#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/iamkhattar/homelab/runs/run-wYTnmT7c89cktvka

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.template_file.agent_node_config: Refreshing...
data.template_file.server_node_config: Refreshing...
data.template_file.server_node_config: Refresh complete after 0s [id=c7a682de3dfbeab911af22ca07d29d163a74b59bdc433be886ea67135171638c]
data.template_file.agent_node_config: Refresh complete after 0s [id=4f000c51219abf7bc9b645ce92462d05468f3d2aa8f055de0aeeb3a79a559755]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_firewall.private_nodes_firewall will be created
  + resource "hcloud_firewall" "private_nodes_firewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "private-nodes-firewall"

      + rule {
          + description     = "Allow all icmp traffic from private network"
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "10.0.0.0/16",
            ]
            # (1 unchanged attribute hidden)
        }
      + rule {
          + description     = "Allow all tcp traffic from private network"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = [
              + "10.0.0.0/16",
            ]
        }
      + rule {
          + description     = "Allow all tcp traffic from private network"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = [
              + "10.0.0.0/16",
            ]
        }
    }

  # hcloud_firewall.public_nodes_firewall will be created
  + resource "hcloud_firewall" "public_nodes_firewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "public-nodes-firewall"

      + rule {
          + description     = "Allow HTTP traffic"
          + destination_ips = []
          + direction       = "in"
          + port            = "80"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "Allow HTTPS traffic"
          + destination_ips = []
          + direction       = "in"
          + port            = "443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "Allow K8S API traffic"
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # hcloud_network.private_network will be created
  + resource "hcloud_network" "private_network" {
      + delete_protection        = false
      + expose_routes_to_vswitch = false
      + id                       = (known after apply)
      + ip_range                 = "10.0.0.0/16"
      + name                     = "k3s-cluster"
    }

  # hcloud_network_subnet.private_network_subnet will be created
  + resource "hcloud_network_subnet" "private_network_subnet" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.1.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # hcloud_server.agent_nodes[0] will be created
  + resource "hcloud_server" "agent_nodes" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-24.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "type" = "agent"
        }
      + location                   = "nbg1"
      + name                       = "agent-node-0"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx32"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)
      + user_data                  = "h2h0fqzN750+iX4LR/vxdZcRSjM="

      + network {
          + alias_ips   = (known after apply)
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # hcloud_server.server_node will be created
  + resource "hcloud_server" "server_node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-24.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "type" = "server"
        }
      + location                   = "nbg1"
      + name                       = "server-node-0"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx32"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)
      + user_data                  = "RVuA4VBRWM67w7UK3EPYmkqz54s="

      + network {
          + alias_ips   = (known after apply)
          + ip          = "10.0.1.1"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + server_node_ip = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 6 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @iamkhattar, Action: `pull_request`*